# BuiltInFailures.FabricSheetFailures Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..FabricSheetFailures Members
BuiltInFailures..::..FabricSheetFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..FabricSheetFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BentFabricSheetTooLongBendingProfile | The bent edge is shorter than the bend profile for this fabric sheet type. |
| FabricSheetOutSideOfHostError | Fabric Sheet is placed completely outside of its host. |
| FabricSheetOutSideOfHostWarning | Fabric Sheet is placed completely outside of its host. |

# See Also
BuiltInFailures..::..FabricSheetFailures Class
Autodesk.Revit.DB Namespace